# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії

alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n'\
                      '"That depends a good deal on where you want to get to," said the Cat.\n'\
                      '"I don\')t much care where ——" said Alice.\n'\
                      '"Then it doesn\'t matter which way you go," said the Cat.\n'\
                      '"—— so long as I get somewhere," Alice added as an explanation.\n'\
                      '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'

# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
print("Task02.\n"
      "Знайдіть та відобразіть всі символи одинарної лапки (') у тексті.")
count = 0
for symbol in alice_in_wonderland:
    if symbol == "'":
        count += 1
        print(f"{count} символ \"'\"")

# task 03 == Виведіть змінну alice_in_wonderland на друк
print(f"\nTask03.\n{alice_in_wonderland}")

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
print("\nTask04.\nПлоща Чорного моря становить 436 402 км2, а площа Азовського моря становить 37 800 км2.\n"
      "Яку площу займають Чорне та Азовське моря разом?")
black_sea_sqr = 436_402
azov_sea_sqr = 37_800

print("Площа Чорного та Азовского морів: ", black_sea_sqr + azov_sea_sqr)

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
print("\nTask 05. \nМережа супермаркетів має 3 склади, де всього розміщено 375 291 товар. \n"
      "На першому та другому складах перебуває 250 449 товарів. На другому та третьому – 222 950 товарів.\n"
      "Знайдіть кількість товарів, що розміщені на кожному складі.")

total = 375_291
first_and_second_stores =  250_449
second_and_third_stores = 222_950

print("Кількість товарів на 1 складі: ", total - second_and_third_stores)
print("Кількість товарів на 2 складі: ", first_and_second_stores + second_and_third_stores - total)
print("Кількість товарів на 3 складі: ", total - first_and_second_stores)

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""

print("\nTask 06. \nМихайло разом з батьками вирішили купити комп’ютер, скориставшись послугою «Оплата частинами».\n"
      "Відомо, що сплачувати необхідно буде півтора року по 1179 грн/місяць.\n"
      "Обчисліть вартість комп’ютера.")

payment_range = 1.5
month_in_year = 12
pay_per_month = 1179

print(f"Вартість комп’ютера: {payment_range * month_in_year * pay_per_month} грн")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print("\nTask07. \n"
      "Знайди остачу від діленя чисел:"
      "a) 8019 : 8, d) 7248 : 6, b) 9907 : 9, e) 7128 : 5, c) 2789 : 5, f) 19224 : 9")

num_dict = {8019: 8, 7248: 6, 9907: 9, 7128: 5, 2789: 5, 19224: 9}

print("Залишок від ділення:")
for divisible, divisor in num_dict.items():
    print(f"    {divisible} на {divisor} - {divisible % divisor}")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""

print("\nTask08. \n"
      "Іринка, готуючись до свого дня народження, склала список того, що їй потрібно замовити.\n"
      "Обчисліть, скільки грошей знадобиться для даного її замовлення. \n"
      "Назва товару    Кількість   Ціна\n"
      "Піца велика     4           274 грн\n"
      "Піца середня    2           218 грн\n"
      "Сік             4           35 грн\n"
      "Торт            1           350 грн\n"
      "Вода            3           21 грн")

item_list = {"Піца велика": [4, 274],
             "Пііца середня": [2, 218],
             "Сік": [4, 35],
             "Торт": [1, 350],
             "Вода": [3, 21]}
total = 0
for values in item_list.values():
    total += values[0] * values[1]
print(f"Знадобиться для даного замовлення: {total} грн")

print()

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
print("\nTask09. \n"
      "Ігор займається фотографією. Він вирішив зібрати всі свої 232 фотографії та вклеїти в альбом.\n"
      "На одній сторінці може бути розміщено щонайбільше 8 фото.\n"
      "Скільки сторінок знадобиться Ігорю, щоб вклеїти всі фото?")

total_photo = 232
photo_on_page = 8

if total_photo % photo_on_page == 0:
    print(f"Ігорю знадобиться {int(total_photo // photo_on_page)} сторінок.")
else:
    print(f"Ігорю знадобиться {int(total_photo / photo_on_page) + 1} сторінок.")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
print("\nTask09. \n"
      "Родина зібралася в автомобільну подорож із Харкова в Будапешт.\n"
      "Відстань між цими містами становить 1600 км.\n"
      "Відомо, що на кожні 100 км необхідно 9 літрів бензину.\n"
      "Місткість баку становить 48 літрів.\n"
      "1) Скільки літрів бензину знадобиться для такої подорожі?\n"
      "2) Скільки щонайменше разів родині необхідно заїхати на заправку під час цієї подорожі,\n"
      "кожного разу заправляючи повний бак?")

total_distance = 1600
litr_100km = 9
full_tank = 48

patrol = 1600 / 100 * litr_100km
q_ty_tanks = patrol // 48

print(f"Знадобиться {patrol} літрів бензину")

if patrol % 48 == 0:
    print(f"Hеобхідно заїхати на заправку {int(q_ty_tanks)} разів(a).")
else:
    print(f"Hеобхідно заїхати на заправку {int(q_ty_tanks) + 1} разів(a).")
